{"chapters":[{"chapter":"","headingText":"","bodyText":"","mapview":"","notes":""},{"chapter":"1","headingText":"Why Bakhmut?","date":"30/09/2022","bodyText":"The city of Bakhmut is of dubious strategic importance to Russia; it was already cut off by Russian occupied areas to the north and south so was contributing little to Ukrainian supply lines. However, it could be a necessary stepping stone for Russia on the path to taking Sloviansk, and Kramatorsk, two medium-sized cities which if taken would give Russia control of most of the Donetsk region.","mapview":"","notes":"","labels":"Bakhmut, Sloviansk, Kramatarorsk"},{"chapter":"1.5","headingText":"Why Bakhmut?","date":"30/09/2022","bodyText":"The strategic imperative to hold Bakhmut before attempting to move on Sloviansk and Kramatorsk became more pressing after the Kharkiv counter-offensive secured the cities' northern approaches for Ukraine.","mapview":"","notes":"","labels":"Bakhmut, Sloviansk, Kramatarorsk"},{"chapter":"2","headingText":"The lie of the land","date":"[a][b][c][d][e][f]","bodyText":"Bakhmut sits in a dell between a number of ridges. In the gaps between the ridges run railways, roads and a river, mostly running north-south through the city. Due west, the ground rises again, separating Bakhmut from the main Donetsk-Kramatorsk road. To the north-west, the M03 motorway runs to Sloviansk.","mapview":"","notes":""},{"chapter":"2.5","headingText":"The heights","date":"[g][h][i][j][k][l]","bodyText":"To the east the ground rises fairly uniformly behind the town's winery. To the west, there are three main ridges - one to the south-west behind the suburb of Ivanivske, one to the west behind a reservoir and racetrack at Khromove, and one to the northwest behind Berkhivka.","mapview":"","notes":"remove railway for this step"},{"chapter":"3","headingText":"The winter offensive","date":"30/01/2023","bodyText":"As the war entered its second phase, and the Russians were pushed back from Kharkiv and put under pressure in Kherson, they began to advance toward Bakhmut. By January they had taken Soledar to the north, and - after some back and forth - controlled ridges on three sides of the town.","mapview":"","notes":""},{"chapter":"4","headingText":"The ‘meat grinder’","date":"30/01/2023","bodyText":"With Russian troops controlling the heights, principally to the east, and Ukrainian troops still holding the high ground to the west, the city itself was dangerously exposed to largely indiscriminate artillery fire from both sides. Shelling largely reduced the town to rubble, but both sides continued to contest the ground fiercely.","mapview":"","notes":""},{"chapter":"5","headingText":"Contested capture","date":"21/05/2023","bodyText":"By the beginning of summer, after a gruelling street-by-street battle that Yevgeny Prigozhin referred to as a \"meat grinder\", Russian claimed to have secured the centre of the town, but continued counter-strikes by Ukraine had the effect of easing - or perhaps beginning to reverse - the encirclement. Ukrainian troops held on to positions on the western ridges and moved into low lying land behind them.","mapview":"","notes":""},{"chapter":"5.5","headingText":"Contested capture","date":"30/05/2023","bodyText":"As Russian officials said they had begun demining Bakhmut - to signal the permanence of its capture, Ukrainian troops held on to positions on the western ridges and moved into low lying land behind them. Ukraine's deputy defence minister remained sanguine about the city, saying home forces held high ground to north and south.","mapview":"","notes":""},{"chapter":"6","headingText":"Counter-strike","date":"06/06/2023","bodyText":"With the city \"secure\" Prigozhin said he would move his Wagner units out, to be replaced by official Russian forces. But as speculation intensified that Ukraine had begun a much-anticipated counter-offensive in the centre of the country, [m]Ukrainian units also began to make headway around Bakhmut, seizing a number of small villages. The deputy defence minister said  \"We're in a good position in Bakhmut. We command the strategic heights\".","mapview":"","notes":""},{"chapter":"6.5","headingText":"Counter-strike","date":"06/06/2023","bodyText":"The same dayPrigozhin himself announced that the Ukrainians had entered Berkhivka to the north, a development which increased the threat to Russian units in Bakhmut, and which Prigozhin described as \"a disgrace\" - he would come to refer to the experience of Bakhmut often as his stance moved from disgruntlement to armed rebellion.","mapview":"","notes":"","labels":"Berkhivka"},{"chapter":"7","headingText":"","date":"27/06/2023","bodyText":"With Prigozhin and his troops otherwise engaged, Ukrainian forces continued to push their advances into areas to the north and south of Bakhmut."}],"a":[],"b":[],"c":[],"d":[],"e":[],"f":[],"g":[],"h":[],"i":[],"j":[],"k":[],"l":[],"m":[]}